cf/Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЯчеестаяИнвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запчасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Инвентаризация/Ext/ManagerModule.bsl
Процедура Печать_Инвентаризация(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Инвентаризация.ПолучитьМакет("Инвентаризация");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСклад	= Макет.ПолучитьОбласть("Склад");
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодписи	= Макет.ПолучитьОбласть("Подписи");
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Ссылка, "Инвентаризация товаров на складе");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьСклад.Параметры.Склад = Ссылка.Склад;
	ТабДок.Вывести(ОбластьСклад);
    ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	    |Номенклатура,
		|Номенклатура.Артикул 	Артикул,
		|Номенклатура 			Товар,
		|ВЫБОР КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
		|	Номенклатура.ЕдиницаИзмерения
		|ИНАЧЕ
		|	Упаковка
		|КОНЕЦ 					ЕдиницаИзмерения,
		|КоличествоУчет 		КоличествоПоУчету,
		|Количество
		|ИЗ
		|	Документ.Инвентаризация.Товары
		|ГДЕ
		|	Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ном = 0;
	Пока Выборка.Следующий() Цикл ном = ном+1;
		ОбластьСтрока.Параметры.НомерСтроки = ном;
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьПодписи.Параметры.Отпустил = Ссылка.Ответственный;
	ТабДок.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	|;
	|ВЫБРАТЬ
	|	Склад, Процесс
	|ИЗ
	|	Документ.Инвентаризация
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// Товары в резерве
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	ДокументРезерва		КАК ДокументРезерва,
	|	Ссылка.Склад		КАК Размещение,
	|	Номенклатура		КАК Номенклатура,
	|	СУММА(	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|			ТОГДА Тов.КоличествоУчет 
	|			ИНАЧЕ Тов.КоличествоУчет * Упаковка.Коэффициент 
	|	КОНЕЦ) КАК Количество
    |ИЗ
	|	Документ.Инвентаризация.Товары Тов
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	Тов.ДокументРезерва <> &ПустаяИнвентаризация И
	|	Тов.КоличествоУчет > 0 И
	|	Тов.Количество = 0 И
	|	Ссылка.Процесс Ссылка БизнесПроцесс.ЯчеестаяИнвентаризация И
	|	Номенклатура.ТипНоменклатуры <> &ТипУслуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументРезерва,
	|	Ссылка.Склад,
	|	Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	ДокументРезерва		КАК ДокументРезерва,
	|	Ссылка.Склад		КАК Размещение,
	|	Номенклатура		КАК Номенклатура,
	|	СУММА(	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|			ТОГДА Тов.Количество 
	|			ИНАЧЕ Тов.Количество * Упаковка.Коэффициент 
	|	КОНЕЦ) КАК Количество
    |ИЗ
	|	Документ.Инвентаризация.Товары Тов
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	Тов.ДокументРезерва <> &ПустаяИнвентаризация И
	|	Тов.КоличествоУчет = 0 И
	|	Тов.Количество > 0 И
	|	Ссылка.Процесс Ссылка БизнесПроцесс.ЯчеестаяИнвентаризация И
	|	Номенклатура.ТипНоменклатуры <> &ТипУслуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументРезерва,
	|	Ссылка.Склад,
	|	Номенклатура
	|;
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипУслуга", 			Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяИнвентаризация",Документы.Инвентаризация.ПустаяСсылка());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 	Пакет[2].Выгрузить());
	
КонецПроцедуры
